{
  "translation": {
    "nav.experience": "Experience",
    "nav.tech_skill": "Tech Skills",
    "nav.projects": "Projects",
    "nav.contact": "Contact",
    "nav.about": "About me",
    "head.hi": "Hi, I am Luis Aguilar.",
    "head.first": "Full Stack Developer with +2 years of experience. Economist and self-taught web developer. Venezuelan living in Barranquilla, Colombia",
    "head.second": ", specialized in scalable and high-performance web applications.",
    "head.ready": "Available to drive your team's success! 🔥",
    "head.contact": "Say Hi!",
    "head.get_cv": "Check My CV",
    "work.title": "Professional Experience",
    "work.name_1": "Prexto Financial Services",
    "work.brief_1": "Designed financial models to calculate ordinary and moratorium interest, optimized database performance using MongoDB aggregation pipelines, and improved microservices architecture. Integrated secure authentication mechanisms (JWT and OAuth2), configured CI/CD pipelines for automated deployments, and managed secure financial data storage with AWS S3.",
    "work.month_1": "March",
    "work.brief_2": "Designed and implemented custom software solutions, optimizing legacy systems by modernizing codebases and implementing efficient stored procedures, achieving a 30% reduction in execution time. Developed APIs for seamless third-party integration and enhanced relational database performance, ensuring scalability, data integrity, and high availability.",
    "work.month_2": "January 2023 - March 2023",
    "work.brief_3": "Designed interactive dashboards and monthly performance reports by integrating financial and operational data. Automated data consolidation to generate financial statements and conducted variance analyses between budgets and actual performance, delivering actionable insights through advanced visualizations.",
    "work.month_3": "June 2021 - January 2023",
    "project.title1": "DisguiseMe - ONLINE",
    "project.link1": "https://costume-app.vercel.app/",
    "project.description1_1": "I developed an application that uses Cloudinary's image transformation services. The service will be available until 01/11/2024.",
    "project.description1_2": "As a cutting-edge platform designed to streamline the user experience with seamless functionality and a modern UI/UX design, I used Zustand for global state management.",
    "project.description1_3": "Integrating advanced technologies like Vite for the frontend and Python for the backend, the application ensures optimal interaction across all devices.",
    "project.urlback1": "https://github.com/LuisAguilarDev/costume_yourself_api",
    "project.urlfront1": "https://github.com/LuisAguilarDev/costume-app",
    "project.title2": "Eagle Clothes - DEPRECATED",
    "project.link2": "https://eagleclothes.vercel.app/",
    "project.description2_1": "I developed the project following the agile SCRUM methodology. It is a web application for clothing purchases that allows users to search and filter items, as well as access their user dashboard through a login I created using MongoDB and Bcrypt.",
    "project.description2_2": "I used React, useReducer for global state management, Material UI, and SASS for styling, along with MongoDB, Express, and TypeScript. I also created backend routes with Express and used Mongoose to filter the data sent to the frontend.",
    "project.description2_3": "The backend takes time to start and may appear broken.",
    "project.urlback2": "https://github.com/LuisAguilarDev/EagleClothes-Backend",
    "project.urlfront2": "https://github.com/LuisAguilarDev/eagleclothes",
    "project.title3": "Eagle Clothes - DEPRECATED",
    "project.description3_1": "It was my first project with JavaScript, a web application that allowed users to search for dog breeds by name and filter by temperament.",
    "project.description3_2": "I used Redux for global state management and pure CSS for styling.",
    "project.description3_3": "On the backend, I used Express to create the routes and PostgreSQL with Sequelize to filter the data sent to the frontend.",
    "project.description3_4": "Although it's deprecated, you can check the code on GitHub for the implementation.",
      "project.urlback3":"https://github.com/LuisAguilarDev/DogBreeds/tree/main/api",
    "project.urlfront3":"https://github.com/LuisAguilarDev/DogBreeds/tree/main/client"
  }
}
